In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('../data/celebrity_deaths_2016.csv',
                 usecols= ['dateofdeath', 'age']
                 )

In [3]:
df['month'] = df['dateofdeath'].str.slice(5,7)
df.set_index('month')
df.head()

  dateofdeath age month
0  2016-01-01  71    01
1  2016-01-01  74    01
2  2016-01-01  79    01
3  2016-01-01  45    01
4  2016-01-01  83    01

In [4]:
df.describe()

       dateofdeath   age month
count         6543  6516  6543
unique         364   138    12
top     2016-11-28    86    01
freq            43   236   669

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6543 entries, 0 to 6542
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   dateofdeath  6543 non-null   object
 1   age          6516 non-null   object
 2   month        6543 non-null   object
dtypes: object(3)
memory usage: 153.5+ KB

In [6]:
df = df.dropna(subset=['age'])
df.describe()

       dateofdeath   age month
count         6516  6516  6516
unique         364   138    12
top     2016-11-28    86    01
freq            42   236   666

In [7]:
df = df[df['age'].str.isdigit()]
df.describe()

       dateofdeath   age month
count         6481  6481  6481
unique         364   104    12
top     2016-11-28    86    01
freq            42   236   665

In [8]:
df['age'] = df['age'].astype(np.int16)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6481 entries, 0 to 6542
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   dateofdeath  6481 non-null   object
 1   age          6481 non-null   int16
 2   month        6481 non-null   object
dtypes: int16(1), object(2)
memory usage: 164.6+ KB

In [9]:
df.describe()

               age
count  6481.000000
mean     77.019287
std      16.428815
min       7.000000
25%      69.000000
50%      81.000000
75%      89.000000
max     116.000000

In [10]:
df['month'] = df['month'].astype(np.int8)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6481 entries, 0 to 6542
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   dateofdeath  6481 non-null   object
 1   age          6481 non-null   int16
 2   month        6481 non-null   int8
dtypes: int16(1), int8(1), object(1)
memory usage: 120.3+ KB

In [11]:
df['age'][(df['month']>1) & (df['month']<8)].mean()

np.float64(77.17887409200968)

In [12]:
df['day'] = df['dateofdeath'].str.slice(8,None)
df['day'] = df['day'].astype(np.int8)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6481 entries, 0 to 6542
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   dateofdeath  6481 non-null   object
 1   age          6481 non-null   int16
 2   month        6481 non-null   int8
 3   day          6481 non-null   int8
dtypes: int16(1), int8(2), object(1)
memory usage: 126.6+ KB

In [13]:
df = df.set_index(['month', 'day'])

df = df.sort_index()

# Get the rows from Feb 15th through July 15th, and the 'age' column, then the average
df.loc[( 2, 15):(7, 15), 'age'].mean()

np.float64(77.05183037332367)

In [14]:
df = pd.read_csv('../data/celebrity_deaths_2016.csv',
                 usecols= ['dateofdeath', 'age', 'causeofdeath']
                 )
df.describe()

       dateofdeath   age causeofdeath
count         6543  6516         1535
unique         364   138          361
top     2016-11-28    86       cancer
freq            43   236          248

In [15]:
df = df.dropna()
df.describe()

       dateofdeath   age causeofdeath
count         1531  1531         1531
unique         356    97          359
top     2016-11-28    68       cancer
freq            27    43          248

In [16]:
df['causeofdeath'].value_counts().head()

causeofdeath
cancer               248
heart attack         125
traffic collision     55
lung cancer           51
pneumonia             50
Name: count, dtype: int64